{
  "automaticAbilities": [
    {
      "ability": "beginGame",
      "detailedDescription": "Move all cards from finished pile, present,past and future areas into the draw deck. Shuffle all cards from 1 to 47 - basically all cards except card 48. The draw deck will contain shuffled cards 1 to 47 and the last card will be card 48. Cards will never be shuffled again and the player will cycle through them over several rounds - 8 total, number of candy minus one. Turn by turn the player may sort the cards in the present area.",
      "shortDescription": "Draw deck should contain shuffled cards 1 to 47 and 48 below them.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"GAME_START",
      "order": -1,
      "next": [0],
      "limit": 1
    },
    {
      "ability": "beginTurn",
      "detailedDescription": "If 'activeAllCardsInFutureAreas' = 0 draw the first 3 cards from the draw stack and place them in the present area. If the activeAllCardsInFutureAreas > 0 place cards in the first available future area into the present area and decrease activeAllCardsInFutureAreas by 1.",
      "shortDescription": "Draw 3 to present or resolve a future area into present.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"TURN_START",
      "order": 0,
      "next": [1],
      "limit": 1
    },
    {
      "ability": "takeCandy",
      "detailedDescription": "Whenever a card with the takeCandy symbol enters the present area at the start of a turn, gain 1 candy token by moving it from the reserved stash into the active stash. Game starts with 5 candy in active stash and 5 candy in reserved stash. Note: the take candy ability only takes place if cards were retrieved in the present area from the draw stack not the past or future areas.",
      "shortDescription": "Gain 1 candy when a takeCandy card enters present from draw.",
      "requiresCandy": false,
      "cards": [3, 6, 10, 15, 21, 28, 36, 45],
      "frequency": 8,
      "type":"TURN_START",
      "order": 1,
      "next": [2],
      "limit": 1
    },
    {
      "ability": "scoreCard",
      "detailedDescription": "Place card in the sorted pile if it can be scored. Applies for cards 1 to 47. It can be scored only if it's the next higher up card in the sorted pile. So if the sorted pile contains 1, 2, 3 and in the present area you now draw 20, 6, 4 then you automatically place 4 in the sorted pile so now sorted contains 1, 2, 3 and 4. After this you must draw a new card from the draw pile",
      "shortDescription": "If the next number, place it in sorted pile and draw a replacement.",
      "requiresCandy": false,
      "cards": [],
      "type":"TURN_START",
      "frequency": 0,
      "order": 2,
      "next": [1, 9],
      "limit": 1
    },
    {
      "ability": "start",
      "detailedDescription": "The starting card of the game. No special effect beyond scoring it automatically in the sorted pile when drawn in the present area.",
      "shortDescription": "Score card 1 immediately when drawn.",
      "requiresCandy": false,
      "cards": [1],
      "frequency": 1,
      "type":"TURN_START",
      "order": 2,
      "next": [1],
      "limit": 1
    },
    {
      "ability": "endTurnBegin",
      "detailedDescription": "Move all cards from the present area into the past area. Remove the candy from all these moved cards putting this candy back in the reserved stash",
      "shortDescription": "Move present cards to past and return their candies to reserve.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"TURN_END",
      "order": 4,
      "next": [5],
      "limit": 1
    },
    {
      "ability": "sequenceRule",
      "detailedDescription": "If you move a sequence of at least 3 cards which are in ascending numerical order after doing the end turn begin ability you receive the number of candy of the sequence length minus one. You get this candy from the reserved stash and place them in the active stash. You may have multiple such sequences and you would get candy for each of them.",
      "shortDescription": "Gain candy for ascending sequences of 3+ moved to past.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"TURN_END",
      "order": 5,
      "next": [6],
      "limit": 1
    },
    {
      "ability": "drinkCofee",
      "detailedDescription": "If card 48 is moved into the past area, automatically spend 1 coffee token. If tokens would drop below 0, the game ends immediately.",
      "shortDescription": "When 48 enters past, spend 1 coffee or lose immediately if below 0.",
      "requiresCandy": false,
      "cards": [48],
      "frequency": 1,
      "type":"TURN_END",
      "order": 6,
      "next": [8, 10],
      "limit": 1
    },
    {
      "ability": "endTurnEnd",
      "detailedDescription": "if there are more than 3 cards in the past area, place the oldest of these cards one after the other below the draw stack until 3 cards remain in the past area. If there are 3 or fewer cards in the past area then no cards are moved below the draw stack.",
      "shortDescription": "Keep only 3 cards in past; put oldest under draw stack.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"TURN_END",
      "order": 8,
      "next": [0],
      "limit": 1
    },
    {
      "ability": "gameEndWin",
      "detailedDescription": "Score card 48 - the game end with victory for the player.",
      "shortDescription": "Game ended with victory for the player",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"GAME_END_VICTORY",
      "order": 9,
      "next": [-1],
      "limit": 1
    },
    {
      "ability": "gameEndLose",
      "detailedDescription": "If card 48 is moved to the past and there are no more coffee tokens left player loses.",
      "shortDescription": "Game ended with defeat for the player",
      "requiresCandy": false,
      "cards": [],
      "frequency": 0,
      "type":"GAME_END_LOSE",
      "order": 10,
      "next": [-1],
      "limit": 1
    }
  ],
  "manualAbilities": [
    {
      "ability": "drawTwo",
      "detailedDescription": "Draw two additional cards from the draw pile for the cost of 1 candy.If there are no cards in the draw pile the card is retrieved from the past area instead.",
      "shortDescription": "Spend 1 candy to draw two extra cards.",
      "requiresCandy": true,
      "cards": [2],
      "frequency": 1,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [1],

      "limit": 1
    },
    {
      "ability": "cardsIntoPast",
      "detailedDescription": "Select 2 cards from the present area and move them into the past pile. Then draw 2 new cards from the draw stack into the present area",
      "shortDescription": "Spend 1 candy to move 2 present cards to past and draw 2.",
      "requiresCandy": true,
      "cards": [5, 11, 17, 23, 25, 41],
      "frequency": 6,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [1],
      "limit": 1
    },
    {
      "ability": "drawOne",
      "detailedDescription": "Draw one additional card from the draw pile. If there are no cards in the draw pile the card is retrieved from the past area instead.",
      "shortDescription": "Spend 1 candy to draw 1 extra card.",
      "requiresCandy": true,
      "cards": [9, 14, 20, 27, 31, 34, 46],
      "frequency": 8,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [1],
      "limit": 1
    },
    {
      "ability": "drawOne3x",
      "detailedDescription": "Draw one additional card from the draw pile. Can be activated 3 times. So each time you put a candy on it you draw a card, can put maximum 3 candy on it.If there are no cards in the draw pile the card is retrieved from the past area instead.",
      "shortDescription": "Spend up to 3 candy to draw up to 3 extra cards.",
      "requiresCandy": true,
      "cards": [47],
      "frequency": 8,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [1],
      "limit": 3
    },
    {
      "ability": "exchangeCard",
      "detailedDescription": "Draw one card from the draw stack and place it into the present area. Then take any one card from the present area - including the one you just drawn and place it face down on top of the draw stack",
      "shortDescription": "Spend 1 candy to swap a present card with the top of draw stack.",
      "requiresCandy": true,
      "cards": [13, 22, 33, 39, 43],
      "frequency": 5,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [1],
      "limit": 1
    },
    {
      "ability": "cardsFromPast",
      "detailedDescription": "Retrieve the first 2 cards from the past pile into the present area.",
      "shortDescription": "Spend 1 candy to move first 2 past cards to present.",
      "requiresCandy": true,
      "cards": [8, 18, 30, 44],
      "frequency": 4,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [2],
      "limit": 1
    },
    {
      "ability": "cardIntoFuture",
      "detailedDescription": "Place one card from the present area into the future pile. When you end your turn by moving the cards from the present area to the past area and begin the next turn by drawing 3 new cards you add that card to the present area",
      "shortDescription": "Spend 1 candy to move a present card to future for next turn.",
      "requiresCandy": true,
      "cards": [12, 19, 32, 40],
      "frequency": 4,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [3],
      "limit": 1
    },
    {
      "ability": "exchangePresentCardOrder",
      "detailedDescription": "Exchange the order of any 2 cards from the present area.",
      "shortDescription": "Swap the order of any two present cards.",
      "requiresCandy": false,
      "cards": [],
      "frequency": 4,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [3],
      "limit": 1
    },
    {
      "ability": "resetCandies",
      "detailedDescription": "Remove all candy currently placed on any cards in the present and future areas, except the one placed on card 37. Place these candy back on the reserved stash. Thus, you may activate all these actions again if you use more candy.",
      "shortDescription": "Spend 1 candy to return all present/future candies except on card 37 to reserve.",
      "requiresCandy": true,
      "cards": [37],
      "frequency": 1,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": 3,
      "limit": 1
    },
    {
      "ability": "allCardsIntoFuture",
      "detailedDescription": "Move all cards from the present area into the future pile. On the next turn, those cards become the new present area. If when trying to activate the allCardsIntoFuture ability after you already activated once this action, you move the first future area one step further into a second future area and move the cards from the present area into the now empty first future area. You now draw 3 cards for the present area. after you decide to move the cards to the past area you rezolve the future areas in reverse order - first future area first. When this ability is executed keep track of the number of future areas by incrementing a 'activeAllCardsInFutureAreas' variable - by default 0.",
      "shortDescription": "Spend 1 candy to move all present cards to future areas.",
      "requiresCandy": true,
      "cards": [16, 24, 26, 35, 38],
      "frequency": 5,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [4],
      "limit": 1
    },
    {
      "ability": "belowTheStack",
      "detailedDescription": "Place all cards from the present area under the draw pile and immediately end the current turn. With this you skip the move to the past step since the present area cards will go in order below the draw stack. After doing this follow the moveToPast ability rule - if there are more than 3 cards in the past area, place the oldest of these cards one after the other below the draw stack until 3 cards remain in the past area. If there are 3 or fewer cards in the past area then no cards are moved below the draw stack.",
      "shortDescription": "Spend 1 candy to place present under draw pile and end turn.",
      "requiresCandy": true,
      "cards": [4, 7, 29, 42],
      "frequency": 4,
      "type":"USER_INPUT_REQUIRED",
      "order": 3,
      "next": [8],
      "limit": 1
    }
  ]
}